{
  "common": {
    "button": {
      "consult": "Request a quote",
      "call": "Call us",
      "submit": "Submit information",
      "loading": "Loading...",
      "close": "Cancel"
    },
    "step": "Step",
    "tel": "Tel",
    "address": "Address"
  },
  "header": {
    "website_design": "Website Design",
    "property_website": "Property Website",
    "furniture_website": "Interior Website",
    "ecommerce_website": "E-commerce",
    "travel_website": "Travel Website",
    "business_website": "Business Website",
    "blog": "Blog",
    "contact": "Contact",
    "vietnamese": "Vietnamese",
    "english": "English"
  },
  "home_page": {
    "section_ids": {
      "design_service": "professional_website_design_service",
      "why_needed": "why_should_you_design_a_website",
      "website_criteria": "criteria_for_website_design",
      "website_framework": "website_design_framework",
      "categorize_website": "classify_website_design_services",
      "design_process": "website_design_process",
      "why_choose_us": "why_should_you_design_your_website_at_riverlee",
      "website_demo": "customers_design_website_at_riverlee",
      "website_pricing": "website_design_pricing",
      "testimonials": "customer_feedback",
      "knowledge": "website_design_knowledge",
      "quote": "website_design_quote"
    },
    "section_1": {
      "heading": "RiverLee Web Agency provides <orange>professional website design services</orange> - with credibility",
      "paragraph_1": "Over 90% of customers at <bold>RiverLee Agency</bold> expect to have a <bold>professional website design</bold> that operates efficiently, supports increased revenue, meets the best SEO standards, and features impressive and attractive designs suitable for their industry characteristics at the most economical cost. We, <bold>RiverLee, a reputable web design company</bold> in Buon Ma Thuot city, are continuously working on the most optimal solutions for these expectations, ready to be a reliable companion for our customers.",
      "paragraph_2": "<italic>“RiverLee Agency always focuses on the user experience when using the website. 100% of the websites 'launched' at RiverLee ensure good display on multiple devices (PC, Mobile, Tablet…), fast page loading speed, and keep up with the latest design trends in the world,”</italic> shared Mr. Giang – Account Director.",
      "paragraph_3": "Mr. Le Thanh Giang is currently the Business Director at RiverLee Agency. With over 2 years of experience in the field of website design, he has had the opportunity to become a strategic consultant on building and developing websites for hundreds of clients, from businesses, shop owners, to individuals. He believes that every website is the most impressive introduction of its owner to their customers and partners.",
      "image_1": "Website design for Buon Ma Thuot city",
      "image_2": "SEO standard website design",
      "image_3": "Affordable website design",
      "image_4": "High-performance website design",
      "image_5": "User-friendly website design"
    },
    "section_2": {
      "heading": "Web Design - Essential Tool in the <orange>“Digital Transformation Race” of Businesses.</orange>",
      "paragraph_1": "In Vietnam, there are over 45,200 searches for keywords like “website design” or <bold>“website design services”</bold> every month, with thousands of <bold>web designs</bold> being created across various fields. But what percentage of these can truly satisfy owners, operate smoothly, and deliver optimal results?",
      "paragraph_2": "With just a few simple steps, the keyword “professional web design” leads you to hundreds of different <bold>web development services</bold>. The diversity in costs and service packages, implemented through various programming technologies, differing strategies, and execution processes... each provider has enriched this field of website construction with a broader spectrum.",
      "paragraph_3": "Moreover, <bold>business entities</bold> that emerged earlier have also begun expanding into the online business market to increase market share and better reach the many customers they once missed out on. Hence, the competition among businesses in the same industry is fiercer than ever.",
      "paragraph_4": "According to a recent study by the Australian Government's Trade and Investment Agency, Vietnam ranks third in Southeast Asia in terms of the number of startups. Also, according to data from the Business Registration Management Agency (Ministry of Planning and Investment), from 2016 to 2019, Vietnam saw over 126,000 new business establishments annually, a 1.6-fold increase compared to the period from 2011 to 2015.",
      "paragraph_5": "Furthermore, the trend of searching for information and shopping online has been booming recently and promises to continue leading in upcoming trends. A new battle has begun, the race for digital business transformation."
    },
    "section_4": {
      "paragraph_1": "<bold>RiverLee Web Design Agency</bold> was founded with the mission to ELEVATE BRANDS IN THE ONLINE MARKET, MAXIMIZE REVENUE GROWTH, focusing on <bold>reputable and professional website design</bold> as the core product and strategy. Simultaneously playing both roles, as a companion and collaborator who listens to the desires and requirements of all clients.",
      "paragraph_2": "One of the first representatives in this race is: <bold>WEBSITES</bold>. You have never had a meticulous, formal website or you already have one but it operates poorly, inefficiently...",
      "paragraph_3": "Your company, your business is being 'invisible' among countless other brands in Google searches, your brand's mark is limited to a specific area. Did you know! You have missed countless new cooperation opportunities, thousands of visits, millions of orders that should have been sold, PR opportunities, brand advertising in the most economical way. What you really need right now is <bold>“a professional and reputable website design agency”</bold>.",
      "paragraph_4": "RiverLee Agency also plays the role of an expert with many years of practical experience in web design, with 500+ websites created and operating steadily. We do not create an overall strategy for your website that is too distant or too large. We are your companion in creating a <bold>beautiful website design</bold> that is SUITABLE – EFFECTIVE – CAPABLE OF QUICKLY INCREASING REVENUE."
    },
    "section_5": {
      "heading": "Reasons Why Should <orange>Design a Website?</orange>",
      "paragraph_1": "We understand that the costs, needs, and industries of each customer segment vary greatly. The ambition of <bold>RiverLee Web Design Services</bold> is to fully meet the website design requirements for a diverse range of customers across various segments, from low to high.",
      "paragraph_2": "According to the Vietnam 2020 White Paper, up to 84% of Internet users (aged 16-64) search online for products and services and make purchasing decisions; 35% make online purchases via computers and 59% through smartphones.",
      "paragraph_3": "All of this shows that <bold>YOUR CUSTOMERS ARE ONLINE</bold> and <bold>DO NOT LET PRODUCTS REMAIN OFFLINE ONLY</bold>.",
      "paragraph_4": "“With experience in consulting, building, and developing over 2000 multi-industry websites at RiverLee Agency, we believe that an effective website combines: aesthetic appeal in design style, operation based on modern programming technology, and alignment with the specific characteristics of each industry”, Mr. Giang further shared."
    },
    "section_6": {
      "heading": "What benefits will you gain from owning a <bold>professional website</bold>?",
      "slide_1": "Customers will always find you with a few search operations, being cared for attentively 24/7.",
      "slide_2": "Maximize reach to all customers regardless of time and space.",
      "slide_3": "Create a fair competitive opportunity among business competitors in the same industry.",
      "slide_4": "Easily identify potential customers through tracking access quality.",
      "slide_5": "Save tangible costs that physical stores need.",
      "slide_6": "Update new products frequently in just a few moments.",
      "slide_7": "Your online home makes it easier to interact with customers, listen, advise, quote, finalize orders...",
      "slide_8": "No restrictions on product promotion, running ads, keyword SEO...",
      "slide_9": "Contribute to building professional credibility for your brand in the online realm."
    },
    "section_7": {
      "heading": "<orange>What criteria</orange> are needed for effective website design?",
      "paragraph_1": "To answer the question 'Is it difficult to design a SEO-standard, effective website?', you will certainly receive the answer: it's not difficult at all, it's quite simple, within a week or even a few days you will have a functioning website.",
      "paragraph_2": "However, professional <bold>web design services</bold> that deliver value in terms of interaction, reach, and product sales are not merely about creating a beautiful and content-rich website. So what criteria truly make your website achieve the expected effectiveness?",
      "criteria_1": {
        "heading": "Eye-catching and appealing interface",
        "description": "The website is designed with a professional, aesthetically pleasing interface, carefully crafted images, creatively designed fonts, all crucial factors in keeping customers engaged longer and providing a richer experience. The <bold>RiverLee web design team</bold> considers not only the visual appeal but also the suitability for each specific industry."
      },
      "criteria_2": {
        "heading": "Emphasis on Content",
        "description": "Content is king in the realm of <bold>premium web design</bold>. Each type of website has its unique way of expressing content, whether formal, humorous, classic, or experience-driven. For specialized websites like introductions or sales, website content not only needs to be polished but also swiftly communicates who you are, what you do, and what products you offer."
      },
      "criteria_3": {
        "heading": "Responsive, cross-platform web design",
        "description": "Limiting your website to just a few devices restricts its reach. With the rise of mobile devices like smartphones and tablets, user demand for accessing websites on these devices surpasses traditional computers. Therefore, <bold>responsive web design</bold> enhances accessibility to current users regardless of the interface they use, ensuring a seamless experience across all platforms."
      },
      "criteria_4": {
        "heading": "Modern web design technologies",
        "description": "Programming languages play a crucial role in the effectiveness of a website. Currently, various programming languages like Wordpress, PHP, JavaScript, C++, each come with their own advantages and disadvantages. Among them, <bold>WordPress-based web design</bold> is highly favored for its multitasking capabilities, scalability, and strong support for SEO."
      },
      "criteria_5": {
        "heading": "SEO optimization capabilities",
        "description": "Creating a SEO-friendly website involves technical optimization such as web coding, interface design, fast page loading speed, etc. This ensures your website can rank well on SERPs."
      },
      "criteria_6": {
        "heading": "Accessibility and page loading speed",
        "description": "A slow-loading website frustrates users and discourages return visits. Many factors contribute to this issue, so ensuring <bold>page speed</bold> is crucial for a professional and effective website."
      },
      "criteria_7": {
        "heading": "Simple administration",
        "description": "Unrestricted management capabilities for clients is a priority for RiverLee. The internal administration software ensures a minimalist and user-friendly design to facilitate data entry, additions, deletions, and changes."
      },
      "criteria_8": {
        "heading": "Smooth functionality",
        "description": "Depending on the specific nature of each website, additional necessary tools and support systems may arise. Therefore, ensuring an effective website design also means balancing all factors to maintain overall operational quality."
      }
    },
    "section_8": {
      "heading": "<orange>The design foundation</orange> of RiverLee's website design service.",
      "paragraph_1": "From the very beginning of venturing into website design, RiverLee Agency has recognized the distinct advantages of two web design technologies: <bold>WordPress</bold> and <bold>NextJS</bold> in the web development process.",
      "paragraph_2": "Before officially launching products, RiverLee's production team spent nearly a year researching, testing, and applying open-source technologies like WordPress and NextJS to design products. As of now, we have over 100 websites across various fields, serving numerous large, medium, and small brands using WordPress/NextJS technology, all operating smoothly and yielding results we are extremely proud of.",
      "question": "Why did RiverLee choose the <bold>WordPress (Open Source Software)</bold> and <bold>NextJS (Javascript Framework)</bold> platforms to complement its website construction strategy?",
      "answer_1": {
        "heading": "Multilingual integration in source code",
        "description": "Both WordPress and NextJS source codes integrate multiple languages on the same website, helping your website reach and engage with customers worldwide."
      },
      "answer_2": {
        "heading": "Large ecosystem",
        "description": "The WordPress and NextJS ecosystems can create hundreds of different types of websites according to consumer design needs: e-commerce sites, real estate websites, interior design sites, corporate websites, etc."
      },
      "answer_3": {
        "heading": "Easy upgrades",
        "description": "If you enjoy innovation and creativity, WordPress/NextJS websites will definitely satisfy you. Upgrading and expanding with WordPress and NextJS is straightforward and flexible."
      },
      "answer_4": {
        "heading": "Continuous improvement",
        "description": "The global WordPress and NextJS communities are vast knowledge repositories, always ready to support and update new features to ensure WordPress/NextJS keeps advancing."
      },
      "answer_5": {
        "heading": "Easy management",
        "description": "The professional website management systems of WordPress and NextJS CMS need no further debate about their convenience and ease of use."
      },
      "answer_6": {
        "heading": "SEO optimization",
        "description": "Like Google's strategic ally, search engine optimization - SEO standards are more effective with the support of NextJS or WordPress."
      },
      "answer_7": {
        "heading": "Feature diversity",
        "description": "Rich plugin/library support is a significant advantage of using these technologies in website design, making it extremely easy to upgrade and add new features."
      },
      "image_1": "The website design platforms WordPress and NextJS"
    },
    "section_9": {
      "heading": "<orange>Multi-industry Website</orange> Design Services",
      "type_1": {
        "heading": "Landing Page Design",
        "description": "Often referred to as a critical destination in Marketing campaigns, a Landing Page is also where potential customers are quickly engaged. If the information on a pure website can easily cause customers to overlook your important goals, a Landing Page will address that and increase conversion more effectively."
      },
      "type_2": {
        "heading": "E-commerce Website Design",
        "description": "Our customers are frequently online; don't keep our goods offline forever. Online shopping now dominates consumer shopping behaviors. A smart e-commerce website with full features will guide customers to find you, easily finalize orders, and make quick payments."
      },
      "type_3": {
        "heading": "Real Estate Website Design",
        "description": "Depending on each client's business purpose, we provide appropriate advice on various types of real estate websites. Owning a standard SEO, high-quality real estate website will significantly support customer engagement and enhance conversion from online to offline."
      },
      "type_4": {
        "heading": "Corporate Website Design",
        "description": "In a world where everyone is on a level playing field, every business builds a strong 'Online home'. Designing a corporate website is a special channel of communication, a distinctive profile that helps customers recognize your brand, affirm trust in your brand, and facilitate cooperation."
      },
      "type_5": {
        "heading": "Interior Design Website",
        "description": "An industry closely associated with aesthetic beauty and sophistication. Therefore, it's understandable that customers have high demands in all visual identity aspects related to the brand. Customers will quickly be convinced if they experience a luxurious, classy, and user-friendly interior design website."
      },
      "type_6": {
        "heading": "Study Abroad Website Design",
        "description": "Providing comprehensive information about living and studying abroad in upcoming countries for parents and students is especially essential. A study abroad website is such a channel. At the same time, it's an important marketing channel for brand promotion campaigns on the Internet (SEO, Google Ads, Facebook Ads...)."
      },
      "type_7": {
        "heading": "Cosmetics Website Design",
        "description": "In an industry with fierce competition and thousands of new names emerging every year, customers have many choices, which means they may easily hesitate during decision-making. A professional, user-friendly cosmetics website will better approach customers and enhance trust in your brand."
      },
      "type_8": {
        "heading": "Skin Care and Spa Website Design",
        "description": "Understanding you through the website, deciding to experience and becoming a loyal customer is something 4.0 era customers still often do. A dull, poorly experienced skin care and spa website with slow page loads risks losing potential customers, and Google quickly forgets your brand."
      },
      "type_9": {
        "heading": "Beauty Clinic Website Design",
        "description": "Representing beauty and stunning transformations, beauty clinics are an area customers carefully consider before choosing an experience. Search information provided online is an indispensable advisor. An impressive, SEO-friendly Beauty Clinic website builds solid trust from the start."
      },
      "type_10": {
        "heading": "Fashion Website Design",
        "description": "In recent years, online shopping trends have surged, including favored fashion products such as clothing, trousers, and accessories. Therefore, a website will be an 'extended arm' to assist sellers in getting closer to customers with needs, quickly enticing them to make final decisions."
      },
      "type_11": {
        "heading": "Construction Website Design",
        "description": "Enhancing reputation, affirming market position online, and building strong customer trust are vital roles of a successfully operated construction website. A standout company introduction website will easily 'engrave' its name in customers' minds, thereby establishing trust."
      },
      "type_12": {
        "heading": "Restaurant and Hotel Website Design",
        "description": "The physical business space isn't limited by real-world square meters. The restaurant or hotel you're running can reach millions of customers across five continents. A restaurant or hotel website helps customers compare, reference, contact immediately, book conveniently and quickly."
      },
      "type_13": {
        "heading": "Travel Website Design",
        "description": "Owning a unique travel website with lightning-fast page load speeds for quick tour booking and online payment capabilities will be a powerful tool for travel and resort businesses to impress customers. Completing and upgrading websites to keep up with the returning travel lifestyle and various breakthrough directions."
      },
      "type_14": {
        "heading": "Education Website Design",
        "description": "Education websites and schools are extremely necessary in today's life. They serve as a valuable information gateway for students and a bridge between schools and parents. Professional education website design helps enhance the quality and credibility of the school, instilling trust in parents' decision-making."
      }
    },
    "section_10": {
      "sub_heading": "6 STEPS TO PERFECT YOUR WEBSITE",
      "heading": "<orange>Professional website design process</orange> at RiverLee",
      "step_1": {
        "heading": "Meet and analyze information provided by the customer.",
        "description": "This is the first step but also one of the most crucial. Professional understanding will impress customers with us right from the start."
      },
      "step_2": {
        "heading": "Outline the direction, specific milestones through a detailed plan",
        "description": "The website development plan is more 'compatible' with brand development goals and more specific will make the project more accurate and fastest."
      },
      "step_3": {
        "heading": "Design, programming, and on-air website testing",
        "description": "This process is always in an accelerating state to run to the finish line. Unique 'tricks' will be used by Water Sailor at appropriate stages to create an effective, full personality website."
      },
      "step_4": {
        "heading": "Adjust, optimize in all aspects and officially launch",
        "description": "At this point, you can rest assured that your 'child' is almost 90% complete, just a few adjustments to suit the web design. The impressive launch."
      },
      "step_5": {
        "heading": "Transfer website management rights",
        "description": "Don't worry or be confused if you have never managed a website. The management team will directly guide and provide accompanying materials such as video, guidebook."
      },
      "step_6": {
        "heading": "Hand over in entirety to truly be your own website",
        "description": "Source code and the highest administrative account will be sent to the true owner of the website. However, the RiverLee provides and supports maximum later maintenance website is even provided"
      }
    },
    "section_11": {
      "heading": "Why should you choose <orange>custom web design services</orange> at RiverLee?",
      "description": "<bold>RiverLee Agency</bold> takes pride in being an experienced expert in the field of website design, having created 100+ websites across various industries. Contact <link>Riverlee.org</link> today to start building a <bold>high-quality website</bold> for your business.",
      "agency_name": "Custom web design services at RiverLee - Specializing in Wordpress/NextJS website design",
      "address": "16 Ma Hai Street, Buon Ma Thuot City, Dak Lak Province",
      "reason_1": {
        "heading": "Customer Care",
        "description": "We are committed to building strong relationships with our customers, ensuring your needs are met with absolute satisfaction."
      },
      "reason_2": {
        "heading": "Modern Technology",
        "description": "Applying the latest trends and advanced technologies ensures your website is only modern, attractive and functions efficiently."
      },
      "reason_3": {
        "heading": "Young and Dynamic Team",
        "description": "Our team consists of young, enthusiastic individuals who are creative and dedicated to delivering excellent web design solutions."
      },
      "reason_4": {
        "heading": "On-time Commitment",
        "description": "We pledge to complete projects on schedule, even ahead of time if the development process goes smoothly."
      },
      "reason_5": {
        "heading": "Data Security",
        "description": "We prioritize data security and respect for customer privacy throughout our collaborative process."
      }
    },
    "section_12": {
      "heading": "Top 20++ highlighted <orange>website interface</orange> templates"
    },
    "section_13": {
      "heading": "<orange>Website Design Pricing</orange> RiverLee",
      "description": "Website design at RiverLee is optimized based on core criteria focusing on customer needs. We recognize that in every industry and scale, a professional and efficient website design is essential. Therefore, our web design service is committed to meeting customer needs across all segments at reasonable prices.",
      "common": {
        "price_from": "Price from",
        "suitable_with": "Suitable for",
        "included": "Included",
        "features": "Basic function programming as required",
        "framework": "Programming platform: NextJS/WordPress",
        "included_1": "Standard UI/UX design - user interface and user experience",
        "included_2": "Responsive standard - compatible with various browsers, devices such as PC, laptop, tablet, mobile,...",
        "included_3": "Optimized page load speed",
        "included_4": "Standard SEO programming",
        "included_5": "Free SSL security for the first year",
        "included_6": "Administrator guidance",
        "included_7": "Source code delivery",
        "included_8": "Lifetime warranty and maintenance",
        "included_9": "24/7 technical support"
      },
      "basic_type": {
        "heading": "Pre-designed interface website",
        "suitable_with_1": "Personal introduction websites, small to medium businesses and shops",
        "suitable_with_2": "Basic e-commerce websites",
        "effect": "Website effects: Basic"
      },
      "premium_type": {
        "heading": "Custom-designed website",
        "suitable_with_1": "Large business introduction websites",
        "suitable_with_2": "Online business, news, services, special finance, high graphics technology,...",
        "effect": "Website effects: Advanced"
      }
    },
    "section_14": {
      "heading": "Customer Feedback",
      "description": "RiverLee Agency is proud to be a <bold>website design service</bold> trusted and chosen by many reputable businesses.",
      "feedback_1": {
        "content": "RiverLee truly impressed me with their website design service for interior design. They not only created a beautiful interface but also fine-tuned every detail to match our company's design style. The website enhances our professionalism and brand credibility online.",
        "name": "Mr. Van Giau",
        "type": "Interior Design Website"
      },
      "feedback_2": {
        "content": "I've worked with several web design companies before, but RiverLee was the first to satisfy me with their ecommerce website design service. They've created a very professional website, well optimized for search engines and user-friendly. I'm impressed with the professionalism and dedication of RiverLee's design team.",
        "name": "Mr. Quoc Oai",
        "type": "Ecommerce Website"
      },
      "feedback_3": {
        "content": "RiverLee's real estate website design service exceeded our expectations. They understood the requirements of the real estate industry well and provided an intuitive interface, making it easy for customers to find information about projects and great features such as 3D tours and project videos.",
        "name": "Mr. Dinh Tuan",
        "type": "Real Estate Website"
      },
      "feedback_4": {
        "content": "The website design for our study abroad service is a major achievement for RiverLee. They've delivered a user-friendly interface that not only guides customers through information about study programs but also provides useful resources such as visa application guides and experience-sharing articles from students who have studied abroad.",
        "name": "Mr. Trong Huy",
        "type": "Study Abroad Website"
      },
      "feedback_5": {
        "content": "The website design for our cosmetics brand by RiverLee is one of the best investments we've made. They've not only created an engaging and visually appealing interface but also ensured that the website is a safe and convenient online shopping destination for customers. Features like product reviews and social media sharing have helped boost our interaction and sales.",
        "name": "Ms. Thuy Linh",
        "type": "Cosmetics Website"
      },
      "feedback_6": {
        "content": "RiverLee has provided us with a very professional and modern website for our automotive dealership. Their interface is not only attractive but also makes it easy to manage automotive products and includes advanced search features, allowing users to easily find the car they want. RiverLee's professionalism and efficiency have truly helped our business establish a strong presence in the market.",
        "name": "Ms. Hong Ngoc",
        "type": "Automotive Website"
      }
    },
    "section_15": {
      "heading": "General knowledge about <orange>websites</orange>",
      "sub_heading": "Stay updated on information, knowledge, and the latest trends about websites."
    },
    "section_16": {
      "heading": "Request <orange>website design price</orange>",
      "sub_heading_1": "Please provide your information to receive a call / email with a price quote from our consultants.",
      "sub_heading_2": "Please contact us with any inquiries:",
      "field_1": {
        "name": "Full Name",
        "error": "Full name must be at least 2 characters long."
      },
      "field_2": {
        "name": "Phone number (+84)",
        "error": "Please enter valid phone number (Starting with +84)."
      },
      "field_3": {
        "error": "Please enter a valid email address."
      },
      "field_4": {
        "name": "Package choice",
        "option_1": "Basic Package",
        "option_2": "Premium Package"
      },
      "field_5": {
        "name": "Message",
        "placeholder": "Is there anything else you'd like to send to RiverLee?"
      },
      "submit_successfully": {
        "heading": "Form submitted successfully",
        "description": "A staff member at RiverLee will contact you as soon as possible."
      },
      "submit_failed": {
        "heading": "Failed to submit form",
        "description": "There was an issue submitting the form. We will resolve it as soon as possible."
      }
    }
  }
}
