{
  "common": {
    "button": {
      "consult": "Request a quote",
      "call": "Call us"
    }
  },
  "header": {
    "website_design": "Website Design",
    "property_website": "Property Website",
    "furniture_website": "Interior Website",
    "ecommerce_website": "E-commerce",
    "travel_website": "Travel Website",
    "business_website": "Business Website",
    "blog": "Blog",
    "contact": "Contact",
    "vietnamese": "Vietnamese",
    "english": "English"
  },
  "home_page": {
    "section_ids": {
      "design_service": "professional_website_design_service",
      "why_needed": "why_should_you_design_a_website",
      "website_criteria": "criteria_for_website_design",
      "website_framework": "website_design_framework"
    },
    "section_1": {
      "heading": "RiverLee Web Agency provides <orange>professional website design services</orange> - with credibility",
      "paragraph_1": "Over 90% of customers at <bold>RiverLee Agency</bold> expect to have a <bold>professional website design</bold> that operates efficiently, supports increased revenue, meets the best SEO standards, and features impressive and attractive designs suitable for their industry characteristics at the most economical cost. We, <bold>RiverLee, a reputable web design company</bold> in Buon Ma Thuot city, are continuously working on the most optimal solutions for these expectations, ready to be a reliable companion for our customers.",
      "paragraph_2": "<italic>“RiverLee Agency always focuses on the user experience when using the website. 100% of the websites 'launched' at RiverLee ensure good display on multiple devices (PC, Mobile, Tablet…), fast page loading speed, and keep up with the latest design trends in the world,”</italic> shared Mr. Giang – Account Director.",
      "paragraph_3": "Mr. Le Thanh Giang is currently the Business Director at RiverLee Agency. With over 2 years of experience in the field of website design, he has had the opportunity to become a strategic consultant on building and developing websites for hundreds of clients, from businesses, shop owners, to individuals. He believes that every website is the most impressive introduction of its owner to their customers and partners.",
      "image_1": "Website design for Buon Ma Thuot city",
      "image_2": "SEO standard website design",
      "image_3": "Affordable website design",
      "image_4": "High-performance website design",
      "image_5": "User-friendly website design"
    },
    "section_2": {
      "heading_part_1": "Web Design - Essential Tool in",
      "heading_part_2": "the “Digital Transformation Race” of Businesses.",
      "paragraph_1": "In Vietnam, there are over 45,200 searches for keywords like “website design” or <bold>“website design services”</bold> every month, with thousands of <bold>web designs</bold> being created across various fields. But what percentage of these can truly satisfy owners, operate smoothly, and deliver optimal results?",
      "paragraph_2": "With just a few simple steps, the keyword “professional web design” leads you to hundreds of different <bold>web development services</bold>. The diversity in costs and service packages, implemented through various programming technologies, differing strategies, and execution processes... each provider has enriched this field of website construction with a broader spectrum.",
      "paragraph_3": "Moreover, <bold>business entities</bold> that emerged earlier have also begun expanding into the online business market to increase market share and better reach the many customers they once missed out on. Hence, the competition among businesses in the same industry is fiercer than ever.",
      "paragraph_4": "According to a recent study by the Australian Government's Trade and Investment Agency, Vietnam ranks third in Southeast Asia in terms of the number of startups. Also, according to data from the Business Registration Management Agency (Ministry of Planning and Investment), from 2016 to 2019, Vietnam saw over 126,000 new business establishments annually, a 1.6-fold increase compared to the period from 2011 to 2015.",
      "paragraph_5": "Furthermore, the trend of searching for information and shopping online has been booming recently and promises to continue leading in upcoming trends. A new battle has begun, the race for digital business transformation."
    },
    "section_4": {
      "paragraph_1": "<bold>RiverLee Web Design Agency</bold> was founded with the mission to ELEVATE BRANDS IN THE ONLINE MARKET, MAXIMIZE REVENUE GROWTH, focusing on <bold>reputable and professional website design</bold> as the core product and strategy. Simultaneously playing both roles, as a companion and collaborator who listens to the desires and requirements of all clients.",
      "paragraph_2": "One of the first representatives in this race is: <bold>WEBSITES</bold>. You have never had a meticulous, formal website or you already have one but it operates poorly, inefficiently...",
      "paragraph_3": "Your company, your business is being 'invisible' among countless other brands in Google searches, your brand's mark is limited to a specific area. Did you know! You have missed countless new cooperation opportunities, thousands of visits, millions of orders that should have been sold, PR opportunities, brand advertising in the most economical way. What you really need right now is <bold>“a professional and reputable website design agency”</bold>.",
      "paragraph_4": "RiverLee Agency also plays the role of an expert with many years of practical experience in web design, with 500+ websites created and operating steadily. We do not create an overall strategy for your website that is too distant or too large. We are your companion in creating a <bold>beautiful website design</bold> that is SUITABLE – EFFECTIVE – CAPABLE OF QUICKLY INCREASING REVENUE."
    },
    "section_5": {
      "heading": "Reasons Why Should Design a Website?",
      "paragraph_1": "We understand that the costs, needs, and industries of each customer segment vary greatly. The ambition of <bold>RiverLee Web Design Services</bold> is to fully meet the website design requirements for a diverse range of customers across various segments, from low to high.",
      "paragraph_2": "According to the Vietnam 2020 White Paper, up to 84% of Internet users (aged 16-64) search online for products and services and make purchasing decisions; 35% make online purchases via computers and 59% through smartphones.",
      "paragraph_3": "All of this shows that <bold>YOUR CUSTOMERS ARE ONLINE</bold> and <bold>DO NOT LET PRODUCTS REMAIN OFFLINE ONLY</bold>.",
      "paragraph_4": "“With experience in consulting, building, and developing over 2000 multi-industry websites at RiverLee Agency, we believe that an effective website combines: aesthetic appeal in design style, operation based on modern programming technology, and alignment with the specific characteristics of each industry”, Mr. Giang further shared."
    },
    "section_6": {
      "heading": "What benefits will you gain from owning a <bold>professional website</bold>?",
      "slide_1": "Customers will always find you with a few search operations, being cared for attentively 24/7.",
      "slide_2": "Maximize reach to all customers regardless of time and space.",
      "slide_3": "Create a fair competitive opportunity among business competitors in the same industry.",
      "slide_4": "Easily identify potential customers through tracking access quality.",
      "slide_5": "Save tangible costs that physical stores need.",
      "slide_6": "Update new products frequently in just a few moments.",
      "slide_7": "Your online home makes it easier to interact with customers, listen, advise, quote, finalize orders...",
      "slide_8": "No restrictions on product promotion, running ads, keyword SEO...",
      "slide_9": "Contribute to building professional credibility for your brand in the online realm."
    },
    "section_7": {
      "heading": "<orange>What criteria</orange> are needed for effective website design?",
      "paragraph_1": "To answer the question 'Is it difficult to design a SEO-standard, effective website?', you will certainly receive the answer: it's not difficult at all, it's quite simple, within a week or even a few days you will have a functioning website.",
      "paragraph_2": "However, professional <bold>web design services</bold> that deliver value in terms of interaction, reach, and product sales are not merely about creating a beautiful and content-rich website. So what criteria truly make your website achieve the expected effectiveness?",
      "criteria_1": {
        "heading": "Eye-catching and appealing interface",
        "description": "The website is designed with a professional, aesthetically pleasing interface, carefully crafted images, creatively designed fonts, all crucial factors in keeping customers engaged longer and providing a richer experience. The <bold>RiverLee web design team</bold> considers not only the visual appeal but also the suitability for each specific industry."
      },
      "criteria_2": {
        "heading": "Emphasis on Content",
        "description": "Content is king in the realm of <bold>premium web design</bold>. Each type of website has its unique way of expressing content, whether formal, humorous, classic, or experience-driven. For specialized websites like introductions or sales, website content not only needs to be polished but also swiftly communicates who you are, what you do, and what products you offer."
      },
      "criteria_3": {
        "heading": "Responsive, cross-platform web design",
        "description": "Limiting your website to just a few devices restricts its reach. With the rise of mobile devices like smartphones and tablets, user demand for accessing websites on these devices surpasses traditional computers. Therefore, <bold>responsive web design</bold> enhances accessibility to current users regardless of the interface they use, ensuring a seamless experience across all platforms."
      },
      "criteria_4": {
        "heading": "Modern web design technologies",
        "description": "Programming languages play a crucial role in the effectiveness of a website. Currently, various programming languages like Wordpress, PHP, JavaScript, C++, each come with their own advantages and disadvantages. Among them, <bold>WordPress-based web design</bold> is highly favored for its multitasking capabilities, scalability, and strong support for SEO."
      },
      "criteria_5": {
        "heading": "SEO optimization capabilities",
        "description": "Creating a SEO-friendly website involves technical optimization such as web coding, interface design, fast page loading speed, etc. This ensures your website can rank well on SERPs."
      },
      "criteria_6": {
        "heading": "Accessibility and page loading speed",
        "description": "A slow-loading website frustrates users and discourages return visits. Many factors contribute to this issue, so ensuring <bold>page speed</bold> is crucial for a professional and effective website."
      },
      "criteria_7": {
        "heading": "Simple administration",
        "description": "Unrestricted management capabilities for clients is a priority for RiverLee. The internal administration software ensures a minimalist and user-friendly design to facilitate data entry, additions, deletions, and changes."
      },
      "criteria_8": {
        "heading": "Smooth functionality",
        "description": "Depending on the specific nature of each website, additional necessary tools and support systems may arise. Therefore, ensuring an effective website design also means balancing all factors to maintain overall operational quality."
      }
    },
    "section_8": {
      "heading": "<orange>The design foundation</orange> of RiverLee's website design service.",
      "paragraph_1": "From the very beginning of venturing into website design, RiverLee Agency has recognized the distinct advantages of two web design technologies: <bold>WordPress</bold> and <bold>NextJS</bold> in the web development process.",
      "paragraph_2": "Before officially launching products, RiverLee's production team spent nearly a year researching, testing, and applying open-source technologies like WordPress and NextJS to design products. As of now, we have over 100 websites across various fields, serving numerous large, medium, and small brands using WordPress/NextJS technology, all operating smoothly and yielding results we are extremely proud of.",
      "question": "Why did RiverLee choose the <bold>WordPress (Open Source Software)</bold> and <bold>NextJS (Javascript Framework)</bold> platforms to complement its website construction strategy?",
      "answer_1": {
        "heading": "Multilingual integration in source code",
        "description": "Both WordPress and NextJS source codes integrate multiple languages on the same website, helping your website reach and engage with customers worldwide."
      },
      "answer_2": {
        "heading": "Large ecosystem",
        "description": "The WordPress and NextJS ecosystems can create hundreds of different types of websites according to consumer design needs: e-commerce sites, real estate websites, interior design sites, corporate websites, etc."
      },
      "answer_3": {
        "heading": "Easy upgrades",
        "description": "If you enjoy innovation and creativity, WordPress/NextJS websites will definitely satisfy you. Upgrading and expanding with WordPress and NextJS is straightforward and flexible."
      },
      "answer_4": {
        "heading": "Continuous improvement",
        "description": "The global WordPress and NextJS communities are vast knowledge repositories, always ready to support and update new features to ensure WordPress/NextJS keeps advancing."
      },
      "answer_5": {
        "heading": "Easy management",
        "description": "The professional website management systems of WordPress and NextJS CMS need no further debate about their convenience and ease of use."
      },
      "answer_6": {
        "heading": "SEO optimization",
        "description": "Like Google's strategic ally, search engine optimization - SEO standards are more effective with the support of NextJS or WordPress."
      },
      "answer_7": {
        "heading": "Feature diversity",
        "description": "Rich plugin/library support is a significant advantage of using these technologies in website design, making it extremely easy to upgrade and add new features."
      },
      "image_1": "The website design platforms WordPress and NextJS"
    }
  }
}
